app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
  def index
    @playlists = Playlist.all

INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MY_FIRST"], ["user_id", 1], ["created_at", "2018-05-29 20:26:33.685345"], ["updated_at", "2018-05-29 20:26:33.685345"]]
---
  def create
    @playlist = Playlist.new(playlist_params)
    @playlist.user = current_user

    respond_to do |format|
      if @playlist.save

UPDATE "playlists" SET "name" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["name", "MyFavourite"], ["updated_at", "2018-05-29 23:42:28.424194"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @playlist.update(playlist_params)

DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]
---
  def destroy
    @playlist.songs.delete_all

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_playlist
      @playlist = Playlist.find(params[:id])