app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)
    @song.playlist = @playlist

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("provider", "uuid", "playlist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", 1], ["uuid", "NUC2EQvdzmY"], ["playlist_id", 1], ["created_at", "2018-05-29 20:28:22.458341"], ["updated_at", "2018-05-29 20:28:22.458341"]]

  def update
    respond_to do |format|
      if @song.update(song_params)
---
UPDATE "songs" SET "provider" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["provider", 0], ["updated_at", "2018-05-29 21:35:29.351827"], ["id", 1]]

    def set_playlist
      @playlist = Playlist.find(params[:playlist_id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]