app/views/playlists/index.html.erb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ?  [["user_id", 1]]
---
                      <p class="has-text-light title"> All Of Your Playlists </p>
                      <% current_user.playlists.each do |playlist| %>