app/views/playlists/show.html.erb


      <% @playlist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = ?  [["playlist_id", 1]]